<?php

// --------------------------------------------------------------
// Устанавливаем разделитель каталогов для среды.
// --------------------------------------------------------------
if ( ! defined('DS'))
{
	define('DS', DIRECTORY_SEPARATOR);
}

// --------------------------------------------------------------
// Установка пути к корневому каталогу
// --------------------------------------------------------------
define('BASE_PATH', __DIR__.DS);

// --------------------------------------------------------------
// Путь к каталогу приложения.
// --------------------------------------------------------------
$paths['APP_PATH'] = 'blog';
// --------------------------------------------------------------
// Путь к каталогу с движком.
// --------------------------------------------------------------
$paths['SYS_PATH'] = 'core';

// --------------------------------------------------------------
// Устанавливаем каждую константу из массива, если она не была установлена ранее.
// --------------------------------------------------------------
foreach ($paths as $name => $path)
{
	if ( ! defined($name))
	{
		$path = "../{$path}";

		define($name, realpath($path).DS);
	}
}
